package week_3.Lists;

import java.util.Arrays;

//2. Flag
//
//        Напишете програма, която отпечатва фигурата по-долу на екрана:
//
//        ██████████
//
//        ██████████
//
//        ██████████
//
//        Създайте масив, който да запълните със символа ‘u2588’, използвайки метода Array.fill().
//
//        Ако ви е интересно, можете да добавите цвят преди всеки ред като отпечатате стринга “�33[ЦВЯТm”, като за цвят имате следните числа:
//
//        39 = бял
//
//        32 = червен
//
//        31 = зелен
//
//        ! ВНИМАНИЕ ! – не пускайте решение с цвят, защото системата ще го приеме за грешно. Направете цвета, само ако сте любопитни и само на вашия компютър.
public class Task_2_Flag {
    public static void main(String[] args) {
        char [] flags = new char[10];
        Arrays.fill(flags, '█');

        for (int i = 0; i < 3; ++i) {
            //System.out.print("\033[32");
            for (int j = 0; j < flags.length; ++j) {
                System.out.print(flags[j]);
            }
            System.out.print("\n");
        }
    }
}
