package week_1.Input_Output;

// TableFormat
//         Нека имате ученици със следните оценки: Иванчо – 2, Марийка – 6, Пенчо – 4, Голям Петко – 5. Използвайте printf да отпечатате оценките им в табличен вид, всеки ученик – на отделен ред.
//
//         Нека дължината на колоната с имената е 20 символа, а колоната с оценките да е 2 символа.
//
//         Имената са първи и са приравнени наляво. Втората колона с оценките е приравнена надясно.
public class Task_3_TableFormat {
    public static void main(String[] args) {
        System.out.printf("|%-20s| %2s|\n", "Име", "О-а");
        System.out.println("---------------------------");
        System.out.printf("|%-20s| %2.1f|\n", "Иванчо", 2.);
        System.out.printf("|%-20s| %2.1f|\n", "Марийка", 6.);
        System.out.printf("|%-20s| %2.1f|\n", "Пенчо", 4.);
        System.out.printf("|%-20s| %2.1f|\n", "Голям Петко", 5.);

    }
}
